### ingest data from college dataset

In [1]:
dataset_id = "college_staging"

In [3]:
!bq --location=US mk --dataset {dataset_id}

BigQuery error in mk operation: Dataset 'cs327e-sp2020:college_staging' already
exists.

### creating tables and loading data into tables

In [9]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.Classes 'gs://college_data_2020/Classes.csv'

Waiting on bqjob_r311507a717a547be_000001700db9b8d4_1 ... (3s) Current status: DONE

In [10]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.Current_Students 'gs://college_data_2020/Current_Students.csv'

Waiting on bqjob_r540c74fddaa32f46_000001700dbbe6d4_1 ... (1s) Current status: DONE

In [11]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.New_Students 'gs://college_data_2020/New_Students.csv'

Waiting on bqjob_r3c67ae9c772108d5_000001700dbc3c29_1 ... (1s) Current status: DONE

### get record count for all 3 tables

In [14]:
%%bigquery
select count(*) as count from college_staging.Classes

   count
0     13

In [15]:
%%bigquery
select count(*) as count from college_staging.Current_Students

   count
0     13

In [17]:
%%bigquery
select count(*) as count from college_staging.New_Students

   count
0      7

### read sample records from tables

In [18]:
%%bigquery
select * from college_staging.Classes
limit 5

,tid,instructor,dept,cno,cname,credits
0,fares,Fares Fraij,CS,CS331E,Elements of Software Engineering,3
1,abraham,Prof. Sarah Abraham,CS,CS329E,Elements of Mobile Computing,3
2,mitra,"Mitra, Shyamal",CS,CS313E,Elements of Software Design,3
3,cannata,PHILIP CANNATA,CS,CS326E,Elements of Networking,3
4,cannata,"Cannata, Philip",CS,CS347,Data Management,3

In [19]:
%%bigquery
select * from college_staging.Current_Students
limit 5

,sid,fname,lname,dob,cno,cname,credits,grade
0,kev18,Kevin,Lin,05/10/1999,CS329E,Elements of Web Programming,3,None
1,paulg,Paul,Gore,2000-09-17,CS329E,Elements of Web Programming,3,A
2,paulg,Paul,Gore,2000-09-17,CS326E - Fall18,Elements of Networking,3,A-
3,paulg,Paul,Gore,09/17/2000,CS313E,Elements of Software Design,3,None
4,bzen26,Biswa,Zen,04/22/1998,CS313E - Fall18,Elements of Software Design,3,B+

In [20]:
%%bigquery
select * from college_staging.New_Students
limit 5

        sid    fname     lname         dob
0    aprilz    April     Lopez  2000-01-10
1  sudeepa4  Sudeepa       Roy  2000-10-01
2    ryan22     Ryan    Watson  2000-11-07
3     dchen    David      Chen  2000-08-22
4     natea   Nathan  Anderson  2000-04-08